// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "此軟體必須安裝在一個啟動卷宗。";
"ERROR_INSTALL" = "此卷宗未符合此更新所需的要求。";

"Newer_Package_Installed_message" = "系統中已安裝了一個較新版本的 Chameleon 。";
"Intel_Mac_message" = "此軟體無法在此電腦上安裝。";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "安裝類型";
"InstallType_description" = "選擇進行全新安裝或更新安裝。";

"New_title" = "全新安裝";
"New_description" = "備份目標分割區已存在的 /Extra 目錄。如果選取 boot 以外的其他安裝選項，將備份原有的 /Extra 設定文件，並建立新的 /Extra 設定文件。";

"Upgrade_title" = "更新安裝";
"Upgrade_description" = "合併目標分割區已存在的 /Extra 目錄。如果選取 boot 以外的其他安裝選項，將合併原有的 /Extra 設定文件。";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "簡而言之，變色龍需要三個必要的檔案。
boot0 (在硬碟的 MBR) 負責載入 boot1。
boot1 (在分割區的開機磁區 boot-sector) 搜尋 boot2。
boot2 (在分割區的根目錄) 載入系統核心等等。";

"Standard_title" = "標準安裝";
"Standard_description" = "此選項會安裝三個必要檔案，並依照您的系統需求將 boot0 或 boot0md 寫入 MBR 的前 440 位元，以避免損壞任何已經存在的 Windows 機碼。然後 boot0 會在第一個啟動分割區搜尋 boot1h，而 boot0md 可以在第二個硬碟的第一個啟動分割區搜尋 boot1h。";

"EFI_title" = "EFI 安裝";
"EFI_description" = "此選項會安裝三個必要檔案到正常隱藏的 EFI 分割區，並依照您的系統需求將 boot0 或 boot0md 寫入 MBR 的前 440 位元，以避免損壞任何已經存在的 Windows 機碼。然後 boot0 會在第一個啟動分割區搜尋 boot1h，而 boot0md 可以在第二個硬碟的第一個啟動分割區搜尋 boot1h。";

"noboot_title" = "皆不安裝";
"noboot_description" = "不安裝變色龍引導器 (適用於僅安裝 Extra 組件)。";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "模組選項";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file.";

"klibc_title" = "klibc";
"klibc_description" = "模組安裝位置 /Extra/modules/klibc.dylib
此模組在 Chameleon 的 library 不敷使用時，可提供一個標準的 c library 給其他模組鏈結使用 。
目前僅有 uClibc++ library 鏈結使用。
源代碼: http://www.kernel.org/pub/linux/libs/klibc/ ";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "模組安裝位置 /Extra/modules/Resolution.dylib
此模組會從連接的主要顯示器中，讀取其螢幕的 EDID 資訊。
這個模組目前並未整合到 trunk 版本內，而是採獨立運作。
另外，此模組會修正早期 Intel HD 顯示卡的 VESA 模式，可在開機引導時，採用正確的解析度。";

"uClibc_title" = "uClibc++";
"uClibc_description" = "模組安裝位置 /Extra/modules/uClibcxx.dylib
此模組提供一個精簡的 c++ runtime library 給其他模組鏈結使用。
模組本身不提供任何功能，而是用來允許其他模組可使用 c++ 語言。
請注意 rtti 和 例外 都已被停用。
源代碼: http://cxx.uclibc.org/
依存: klibc ";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "模組安裝位置 /Extra/modules/Keylayout.dylib
鍵盤佈局，此模組允許使用者定義鍵盤按鍵的映射。";

// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "工具選項";
"Utility_description" = "協助安裝設定的檔案。";

"PrefPanel_title" = "系統偏好設定面板";
"PrefPanel_description" = "安裝 Chameleon 系統偏好設定面板。";

"SMBIOSDefault_title" = "SMBios.plist";
"SMBIOSDefault_description" = "複製 smbios.plist 範例 至 /Extra/Configuration。";

"Documentation_title" = "說明文件";
"Documentation_description" = "Chameleon 手動安裝及使用的說明文件。";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "開機選項";
"Options_description" = "創建 /Extra/org.chameleon.Boot.plist 及選用您需要的 Chameleon 開機選項及內核參數。";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "(預設是 Yes) 隱藏 圖形使用者介面的 Chameleon 開機選單。";

"GUI_title" = "GUI=No";
"GUI_description" = "(預設是 Yes) 停用 預設開啟之圖形使用者介面。";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "(預設是 No) 開機畫面使用傳統的 Apple 圖示(白底灰蘋果)，而不使用主題內所定義之 boot.png。";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "(預設是 No) 跳過倒數畫面，直接顯示分割區開機選擇畫面。";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "(預設是 No) 啟用安靜開機模式(不會出現訊息或提示)。";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "(預設是 No) 啟用 在開機圖示選單左上方顯示分割區及解析度的詳細資訊的功能。雖然會與一些背景主題發生衝突，在問題排除時，卻是非常有用的資訊。";

"Wait_title" = "Wait=Yes";
"Wait_description" = "(預設是 No) 在 Chameleon 載入完畢後暫停，並在 按任意鍵 後繼續載入 mach kernel，適合問題排除時搭配 (-v) 記錄模式開機一起使用。";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "(預設是 64 位) 啓用 32 位模式引導內核開機，而非預設的 64 位開機。";

"EHCIacquire_title" = "EHCIacquire=Yes";
"EHCIacquire_description" = "(預設是 No) 啟用 EHCI 修正功能，可修復任何不良 BIOS 造成的 EHCI 所有權問題。";

"EthernetBuiltIn_title" = "EthernetBuiltIn=Yes";
"EthernetBuiltIn_description" = "(預設是 No) 啟用將乙太網路卡設定成『內建』的功能。此功能只可讓網路卡識別為內建，並無驅動的功能。";

"ForceHPET_title" = "ForceHPET=Yes";
"ForceHPET_description" = "(預設是 No) 對 BIOS 中無 HPET 選項之 Intel 晶片組主機板，強制開啟 HPET 功能。";

"ForceWake_title" = "ForceWake=Yes";
"ForceWake_description" = "(預設是 No) 啟用強制覆蓋睡眠資料映像功能，此選項可以覆蓋並忽略不正確之休眠映像檔。";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "(預設是 Yes) 停用 自動啟用的重新開機修正功能 (Intel CPU 專用)。";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "(預設是 No) 啟用 UHCI 修正功能。可在進入 OS X 之前，先重置 UHCI 控制器。";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "(預設是 Yes) 停用 自動啟用的記憶體識別功能。";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "(預設是 No) Lion 專用，選用 Yes 將載入預鏈接的 KernelCache，並忽略 /Extra/Extensions 和 /System/Library/Extensions 及 Extensions.mkext。建議在 KernelCache 已內含所有必要的驅動時，才啓用。";

"Wake_title" = "Wake=Yes";
"Wake_description" = "(預設是 No) 啟用睡眠喚醒功能，嘗試載入最後一次休眠時保存的睡眠映像。";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States New=Yes";
"CSTUsingSystemIO_description" = "(預設是 No) 採用 SystemIO registers 生成 C-States _CST 的新方法。(非原來的 FixedHW 方法)";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "(預設是 No) 設定 Yes 忽略主機板 BIOS 內建之 SSDT 表，可讀取 Extra 資料夾中的 SSDT 資料。/Extra/SSDT.aml。";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "(預設是 No) 強制生成 C2 State 為管理 CPU 電源狀態，可以讓 CPU 在閒置狀態下處於低功耗狀態。一般來說數字越大其節能效果愈佳。";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "(預設是 No) 強制生成 C3 State 為管理 CPU 電源狀態，可以讓 CPU 在閒置狀態下處於低功耗狀態。一般來說數字越大其節能效果愈佳。";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "(預設是 No) 強制生成 C4 State 為管理 CPU 電源狀態，可以讓 CPU 在閒置狀態下處於低功耗狀態。一般來說數字越大其節能效果愈佳。";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "(預設是 No) 啟用自動生成 CPU 閒置休眠狀態的功能 (C-States)，管理 CPU 電源狀態，可以讓 CPU 在閒置狀態下處於不同低功耗狀態。";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "(預設是 No) 啟用自動生成 CPU 功耗表現狀態的功能 (P-States)，管理 CPU 性能狀態，可以讓 CPU 在不同負載量下改變功耗。";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "設定螢幕解析度為 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "設定螢幕解析度為 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "設定螢幕解析度為 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "設定螢幕解析度為 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "設定螢幕解析度為 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "設定螢幕解析度為 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "設定螢幕解析度為 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "設定螢幕解析度為 1600x900x32";

"1600x1200x32_title" = "1600x1200x32";
"1600x1200x32_description" = "設定螢幕解析度為 1600x1200x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "設定螢幕解析度為 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "設定螢幕解析度為 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "設定螢幕解析度為 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "(預設是 No) 啟用顯示卡偵測功能。自動識別 顯示卡 GPU 並注入正確的設備屬性資訊。";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "(預設是 No) 啟用 ATI EEPRom 功能，可在不刷顯示卡 BIOS 的情況下使用修改的 Rom。請命名為 「VenderID_DeviceID_SubsysID.rom」 放置 Extra 資料夾。如：/Extra/1002_68C1_FD501179.rom。";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "(預設是 No) 啟用 Nvidia EEPRom 功能，可在不刷顯示卡 BIOS 的情況下使用修改的 Rom。請命名為 「VenderID_DeviceID.rom」 放置 Extra 資料夾。如：/Extra/10de_0614.rom。";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "(預設是 No) 啟用 Nvidia VBIOS 功能。僅針對 Nvidia 顯示卡的參數選項，ATI 顯示卡請勿使用。啟用讀取顯示卡參數，可在顯示卡資訊中顯示 ROM 修正版 資訊。";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "-v 記錄模式";
"Verbose_description" = "使用 (-v) 記錄模式登入，允許你在螢幕上讀取 變色龍 和 OS X 內核 兩者在開機時產生的紀錄訊息。這是在開機時排除問題的基本用法。";

"Singleusermode_title" = "-s 單一使用者模式";
"Singleusermode_description" = "使用 (-s) 單一使用者模式登入，在排除問題時，可於在開機使用 (-s) 進入 OS X 的 BSD/Unix 命令模式。";

"Ignorecaches_title" = "-f 忽略 Caches";
"Ignorecaches_description" = "使用 (-f) 忽略 Caches 模式登入，並非每日開機必備的的選項，但可經由忽略預製的 Caches ，以使 OS X 可以重新載入所有位於系統目錄的 kext 檔案。";

"Npci_title" = "npci=0x2000";
"Npci_description" = "可在某些系統上排除 'PCI configuration begin' 的錯誤。0x2000 是 kIOPCIConfiguratorPFM64 flag，可在 IOPCIFamily 的 source code 中找到相關訊息。";

"Npci3_title" = "npci=0x3000";
"Npci3_description" = "可在某些系統上排除 'PCI configuration begin' 的錯誤。0x3000 是 kIOPCIConfiguratorPFM64 flag，可在 IOPCIFamily 的 source code 中找到相關訊息。";


"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion 專用。停用 'low power wake' 的功能，在螢幕睡眠喚醒之後，有時可能會發生螢幕黑屏的狀況。";


// ----------------------------------------------------------------------------
// Boot options - KEYMAPS
// ----------------------------------------------------------------------------

"mac-de_title" = "德語 Mac 鍵盤佈局";
"mac-de_description" = "使用德國的 Mac 鍵盤的鍵盤佈局";

"mac-es_title" = "西班牙語 Mac 鍵盤佈局";
"mac-es_description" = "使用西班牙的 Mac 鍵盤的鍵盤佈局";

"mac-fr_title" = "法語 Mac 鍵盤佈局";
"mac-fr_description" = "使用法國的 Mac 鍵盤的鍵盤佈局";

"mac-it_title" = "意大利語 Mac 鍵盤佈局";
"mac-it_description" = "使用意大利的 Mac 鍵盤的鍵盤佈局";

"mac-se_title" = "瑞典語 Mac 鍵盤佈局";
"mac-se_description" = "使用瑞典的 Mac 鍵盤的鍵盤佈局";

"mac-pt_title" = "Portuguese Mac Keyboard";
"mac-pt_description" = "Use the keyboard layout for a Portuguese Mac keyboard";

"pc-de_title" = "German PC Keyboard";
"pc-de_description" = "Use the keyboard layout for a German PC keyboard";

"pc-es_title" = "Spanish PC Keyboard";
"pc-es_description" = "Use the keyboard layout for a Spanish PC keyboard";

"pc-fr_title" = "法語 PC 鍵盤佈局";
"pc-fr_description" = "使用法國的 PC 鍵盤的鍵盤佈局";

"pc-it_title" = "Italian PC Keyboard";
"pc-it_description" = "Use the keyboard layout for a Italian PC keyboard";

"pc-se_title" = "Swedish PC Keyboard";
"pc-se_description" = "Use the keyboard layout for a Swedish PC keyboard";

"pc-pt_title" = "Portuguese PC Keyboard";
"pc-pt_description" = "Use the keyboard layout for a Portuguese PC keyboard";

// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "內崁主題";
"Embed_description" = "Embed：小而簡單且可於編譯 boot 時，內崁在 Chameleon 裡的主題. ";

"Legacy_title" = "傳統主題";
"Legacy_description" = "Legacy：Chameleon v2.0 RC1 的原始預設主題.";

"Default_title" = "預設主題";
"Default_description" = "Default：Chameleon v2.0 RC5 的新版預設主題.";

"Bullet_title" = "子彈主題";
"Bullet_description" = "Bullet：來自 NoSmokingBandit 2009.4 的一個小巧可愛的子彈主題.";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "控制選項";
"Control_description" = "設定控制 Chameleon 的運作方式。";

// General
"General_title" = "一般選項";
"General_description" = "選取一些基本的選項。";

// KernelFlags
"KernelFlags_title" = "內核參數";
"KernelFlags_description" = "選取有關 kernel flags 的各種內核參數設定。";

// PowerManagement
"PowerManagement_title" = "電源管理";
"PowerManagement_description" = "一些設定電源管理和 speedstep 的選項。";

// Resolution
"Resolution_title" = "解析度設定";
"Resolution_description" = "Set one resolution to use.";

// Video
"Video_title" = "顯示卡選項";
"Video_description" = "一些設定顯示卡的選項。";

// Keymaps
"Keymaps_title" = "鍵盤佈局";
"Keymaps_description" = "Select one keylayout to use. This will also install the Keylayout module and keymaps.";

// Themes
"Themes_title" = "主題選項";
"Themes_description" = "收集的一些主題範例。
可在 http://forum.voodooprojects.org/index.php/board,7.0.html 找到更多的主題。";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "不安裝";
"ChooseNone-Resolution_description" = "不選取安裝任何螢幕解析度。";

"ChooseNone-keylayout_title" = "不安裝";
"ChooseNone-keylayout_description" = "不選取安裝任何鍵盤佈局。";
